Tekla.Structures.DirectManipulation.Model.CustomPartPropertySelector
The CustomPartPropertySelector class gets properties of a custom part from core. Note that it handles the properties of the
custom part type, note an instance in the model and does not insert an instance to get the properties.

Tekla.Structures.DirectManipulation.Model.CustomPartPropertySelector.GetCustomPartExtrema(System.String,Tekla.Common.Geometry.Vector3@,Tekla.Common.Geometry.Vector3@)
Gets the extrema of the custom part. These are in the custom part's own coordinate system,
since the extrema of the custom part type would be meaningless in locals.
customPartName: The name of the custom part type.
minPoint: The minimum point of the extrema.
maxPoint: The maximum point of the extrema.
Returns: True if the extrema was successfully retrieved, otherwise false.

Tekla.Structures.DirectManipulation.Model.CustomPartPropertySelector.GetCustomPartEdges(System.String,System.Collections.Generic.IList{Tekla.Common.Geometry.Segment3}@)
Gets the edges of the custom part type's geometry. These are in the custom part's own coordinate system,
since the geometry of the custom part type would be meaningless in locals.
customPartName: The name of the custom part type.
edges: The edges of the custom part.
Returns: True if the edges were successfully retrieved, otherwise false.